In [1]:
#creating of dataframes
import pandas as pd
data={"Name":["John","Peter","Lisa"],
     "Age":[25,28,31],
     "Salary":[30000,45000,25000]}
df=pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   John   25   30000
1  Peter   28   45000
2   Lisa   31   25000

In [2]:
data=pd.read_csv('./train.csv')
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [3]:
#for reading csv files
!pip install openpyxl
import pandas as pd
data=pd.read_csv('./Mall_Customers.csv')
print(data)

Requirement already satisfied: openpyxl in c:\users\rohit\anaconda\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\rohit\anaconda\lib\site-packages (from openpyxl) (1.1.0)
     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [4]:
#exploring data in pandas
data=pd.read_csv('./Mall_Customers.csv')
print(data)

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [5]:
print(data.head(10)) #first 10 values

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40
5           6  Female   22                  17              76
6           7  Female   35                  18               6
7           8  Female   23                  18              94
8           9    Male   64                  19               3
9          10  Female   30                  19              72

In [6]:
print(data.tail(10)) #last 10 values

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
190         191  Female   34                 103              23
191         192  Female   32                 103              69
192         193    Male   33                 113               8
193         194  Female   38                 113              91
194         195  Female   47                 120              16
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

In [7]:
print(data.info()) #gives information abou that csv

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CustomerID          200 non-null    int64
 1   Genre               200 non-null    object
 2   Age                 200 non-null    int64
 3   Annual_Income_(k$)  200 non-null    int64
 4   Spending_Score      200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB
None

In [8]:
data.describe()

       CustomerID         Age  Annual_Income_(k$)  Spending_Score
count  200.000000  200.000000          200.000000      200.000000
mean   100.500000   38.850000           60.560000       50.200000
std     57.879185   13.969007           26.264721       25.823522
min      1.000000   18.000000           15.000000        1.000000
25%     50.750000   28.750000           41.500000       34.750000
50%    100.500000   36.000000           61.500000       50.000000
75%    150.250000   49.000000           78.000000       73.000000
max    200.000000   70.000000          137.000000       99.000000

In [9]:
print(data.isnull().sum())

CustomerID            0
Genre                 0
Age                   0
Annual_Income_(k$)    0
Spending_Score        0
dtype: int64

In [10]:
#handling duplicate values in pandas
print(data.duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
195    False
196    False
197    False
198    False
199    False
Length: 200, dtype: bool

In [11]:
#duplicated column wise
print(data.duplicated(['CustomerID','Age']).sum())

0

In [12]:
#to drop duplicates
print(data.drop_duplicates())

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [13]:
print(data.drop_duplicates('CustomerID'))

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [14]:
#working with missing data or handling null values
print(data.isnull())

     CustomerID  Genre    Age  Annual_Income_(k$)  Spending_Score
0         False  False  False               False           False
1         False  False  False               False           False
2         False  False  False               False           False
3         False  False  False               False           False
4         False  False  False               False           False
..          ...    ...    ...                 ...             ...
195       False  False  False               False           False
196       False  False  False               False           False
197       False  False  False               False           False
198       False  False  False               False           False
199       False  False  False               False           False

[200 rows x 5 columns]

In [15]:
print(data.isnull().sum())

CustomerID            0
Genre                 0
Age                   0
Annual_Income_(k$)    0
Spending_Score        0
dtype: int64

In [16]:
print(data.dropna())

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [17]:
import numpy as np
print(data.replace(np.nan,30000))

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [18]:
data["Spending_Score"]=data["Spending_Score"].replace(np.nan,30000)
print(data)
print(data["Spending_Score"].mean())

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]
50.2

In [19]:
print(data.fillna(method="bfill")) #bfil - backwardfill - it takes the backward value of that number

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

C:\Users\rohit\AppData\Local\Temp\ipykernel_2028\911192665.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill")) #bfil - backwardfill - it takes the backward value of that number

In [20]:
print(data.fillna(method="ffill")) #ffil - forwardfill - it takes the forward value of that number
#both bfill and ffill used for data cleaning purpose
'''especially when the assumption of the location of the missing value with the previous or next value is reasonable and has a pattern in some columns, provided that the ffill and bfill functions must be assisted by other functions.'''

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

C:\Users\rohit\AppData\Local\Temp\ipykernel_2028\1234282104.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill")) #ffil - forwardfill - it takes the forward value of that number

'especially when the assumption of the location of the missing value with the previous or next value is reasonable and has a pattern in some columns, provided that the ffill and bfill functions must be assisted by other functions.'

In [21]:
print(data.fillna("hi"))

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [22]:
data=pd.read_csv('./Mall_Customers.csv')
print(data)

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [23]:
data.loc[(data["Annual_Income_(k$)"]<15),"Get Bonus"]="no bonus"
data.loc[(data["Annual_Income_(k$)"]>15),"Get Bonus"]="bonus"
print(data.head(10))

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score Get Bonus
0           1    Male   19                  15              39       nan
1           2    Male   21                  15              81       nan
2           3  Female   20                  16               6     bonus
3           4  Female   23                  16              77     bonus
4           5  Female   31                  17              40     bonus
5           6  Female   22                  17              76     bonus
6           7  Female   35                  18               6     bonus
7           8  Female   23                  18              94     bonus
8           9    Male   64                  19               3     bonus
9          10  Female   30                  19              72     bonus

In [24]:
#methods of column transformation
data["Bonus"]=(data["Annual_Income_(k$)"]/100)*20
print(data)

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score Get Bonus  \
0             1    Male   19                  15              39       nan
1             2    Male   21                  15              81       nan
2             3  Female   20                  16               6     bonus
3             4  Female   23                  16              77     bonus
4             5  Female   31                  17              40     bonus
..          ...     ...  ...                 ...             ...       ...
195         196  Female   35                 120              79     bonus
196         197  Female   45                 126              28     bonus
197         198    Male   32                 126              74     bonus
198         199    Male   32                 137              18     bonus
199         200    Male   30                 137              83     bonus

     Bonus
0      3.0
1      3.0
2      3.2
3      3.2
4      3.4
..     ...
195   24.0
196   25.2
197   25.2
198   27.4
199   27.4

[200 rows x 7 columns]

In [25]:
data={"Months":["January","February","March","April"]}
a=pd.DataFrame(data)
print(a)
def extract(value):
    return value[0:3]
a["Short_months"]=a["Months"].map(extract)
print(a)

     Months
0   January
1  February
2     March
3     April
     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

In [26]:
#group by i column transforming
gp = data.groupby("Age").agg({"Genre":"count"}).reset_index()
print(gp)

AttributeError: 'dict' object has no attribute 'groupby'

In [ ]:
#Merge,Join and Concatenate in pandas
import pandas as pd

data1 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06"],
    "Names": ["Ram", "Shyam", "Rahul", "Vishal", "Ravi", "John"],
    "Age": [34, 56, 23, 44, 32, 36]
}

data2 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06"],
    "Salary": [45000, 56000, 34000, 30000, 50000, 62000]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

In [ ]:
print(pd.merge(df1,df2,on="Emp Id"))

In [ ]:
data1 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06"],
    "Names": ["Ram", "Shyam", "Rahul", "Vishal", "Ravi", "John"],
    "Age": [34, 56, 23, 44, 32, 36]
}

data2 = {
    "Emp Id": ["E01", "E07", "E03", "E04", "E08", "E06"],
    "Salary": [45000, 56000, 34000, 30000, 50000, 62000]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

In [ ]:
print(pd.merge(df1,df2,on="Emp Id")) #here we have only 4 common value so it takes 4 values and it will never take differrent values

In [ ]:
print(pd.merge(df1,df2,on="Emp Id",how="left"))
#it works like as left join in sql as it will returns the all the df1 table value , 
#that it checks the commons first and th different ones in the first dataframe will also be return
#but the coulumn which is different it will take null value or which is not available

In [ ]:
print(pd.merge(df1,df2,on="Emp Id",how="right"))
#it works like as right join in sql as it will returns the all the df2 table value , 
#that it checks the commons first and the different ones in the second dataframe will also be return
#but the coulumn which is different it will take null value or which is not available

In [ ]:
print(pd.merge(df1,df2,on="Emp Id",how="inner"))
#it works like as inner join in sql as it will returns only the common value , 
#that it checks the commons first and it will return the only same data in both dataframes

In [29]:
data1 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05", "E06"],
    "Names": ["Ram", "Shyam", "Rahul", "Vishal", "Ravi", "John"],
    "Age": [34, 56, 23, 44, 32, 36]
}

data2 = {
    "Emp Id": ["E07", "E08", "E09", "E10", "E11", "E12"],
    "Names": ["Rohith", "Vinay", "Revanth", "Jashwanth", "Venu", "Sandeep"],
    "Age": [21, 20, 23, 56, 31, 35]
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36
  Emp Id      Names  Age
0    E07     Rohith   21
1    E08      Vinay   20
2    E09    Revanth   23
3    E10  Jashwanth   56
4    E11       Venu   31
5    E12    Sandeep   35

In [31]:
print(pd.concat([df1,df2]))

  Emp Id      Names  Age
0    E01        Ram   34
1    E02      Shyam   56
2    E03      Rahul   23
3    E04     Vishal   44
4    E05       Ravi   32
5    E06       John   36
0    E07     Rohith   21
1    E08      Vinay   20
2    E09    Revanth   23
3    E10  Jashwanth   56
4    E11       Venu   31
5    E12    Sandeep   35

In [52]:
#Compare Data Frames
dict={"Fruits":["Mango","Apple","Banana","Papaya"],
     "Price":[100,150,50,35],
     "Quantity":[15,10,10,3],
     "Quality":["Nice","OK","Better","Average"]}
df=pd.DataFrame(dict)
print(df)

   Fruits  Price  Quantity  Quality
0   Mango    100        15     Nice
1   Apple    150        10       OK
2  Banana     50        10   Better
3  Papaya     35         3  Average

In [53]:
df3=df.copy()
print(df3)

   Fruits  Price  Quantity  Quality
0   Mango    100        15     Nice
1   Apple    150        10       OK
2  Banana     50        10   Better
3  Papaya     35         3  Average

In [54]:
df3.loc[0,"Price"]=120
df3.loc[1,"Price"]=175
df3.loc[3,"Price"]=30
df3.loc[0,"Quantity"]=12
df3.loc[1,"Quantity"]=15
df3.loc[3,"Quantity"]=5
print(df3)

   Fruits  Price  Quantity  Quality
0   Mango    120        12     Nice
1   Apple    175        15       OK
2  Banana     50        10   Better
3  Papaya     30         5  Average

In [55]:
#adding of column
df3.loc[0,"Quality"]="Nice"
df3.loc[1,"Quality"]="OK"
df3.loc[2,"Quality"]="Better"
df3.loc[3,"Quality"]="Fine"
print(df3)

   Fruits  Price  Quantity Quality
0   Mango    120        12    Nice
1   Apple    175        15      OK
2  Banana     50        10  Better
3  Papaya     30         5    Fine

In [60]:
#comparing
print(df.compare(df3)) #it didnt returned index 2 values becoz their all values same
#compare returns the self and other , slef -> previous values and other->new values

   Price        Quantity        Quality
    self  other     self other     self other
0  100.0  120.0     15.0  12.0      NaN   NaN
1  150.0  175.0     10.0  15.0      NaN   NaN
3   35.0   30.0      3.0   5.0  Average  Fine

In [63]:
print(df.compare(df3,keep_equal=True)) 
#here it returns which are diffrent in both data frames and it converts float value to integer value
#and if there are anu same it will print NaN

  Price       Quantity        Quality
   self other     self other     self other
0   100   120       15    12     Nice  Nice
1   150   175       10    15       OK    OK
3    35    30        3     5  Average  Fine

In [64]:
print(df.compare(df3,keep_shape=True)) 
# same like as keep_equal=True but it shows every data in data frame which are also different

  Fruits        Price        Quantity        Quality
    self other   self  other     self other     self other
0    NaN   NaN  100.0  120.0     15.0  12.0      NaN   NaN
1    NaN   NaN  150.0  175.0     10.0  15.0      NaN   NaN
2    NaN   NaN    NaN    NaN      NaN   NaN      NaN   NaN
3    NaN   NaN   35.0   30.0      3.0   5.0  Average  Fine

In [73]:
#pivoting and melting Data Frames
dict={"Key":["K1","K2","K1","K2"],
     "Names":["John","Ben","David","Peter"],
     "Houses":["Red","Blue","Green","Red"]}
df=pd.DataFrame(dict)
print(df)
print(df.pivot(index="Key",columns="Names",values="Houses"))

  Key  Names Houses
0  K1   John    Red
1  K2    Ben   Blue
2  K1  David  Green
3  K2  Peter    Red
Names   Ben  David John Peter
Key
K1      NaN  Green  Red   NaN
K2     Blue    NaN  NaN   Red

In [77]:
dict={"Key":["K1","K2","K1","K2"],
     "Names":["John","Ben","David","Peter"],
     "Houses":["Red","Blue","Green","Red"],
     "Grades":["3rd","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)
print("After Pivoting:")
print(df.pivot(index="Key",columns="Names",values=["Houses","Grades"]))

  Key  Names Houses Grades
0  K1   John    Red    3rd
1  K2    Ben   Blue    8th
2  K1  David  Green    9th
3  K2  Peter    Red    8th
After Pivoting:
      Houses                   Grades
Names    Ben  David John Peter    Ben David John Peter
Key
K1       NaN  Green  Red   NaN    NaN   9th  3rd   NaN
K2      Blue    NaN  NaN   Red    8th   NaN  NaN   8th

In [79]:
#melting
dict={
         "Names":["Lisa","Ben","Maria","David"],
         "Gender":["F","M","F","M"],
         "Age":[23,24,30,27]
}
df=pd.DataFrame(dict)
print(df)
print(pd.melt(df,id_vars=["Names"],value_vars=["Gender","Age"]))

   Names Gender  Age
0   Lisa      F   23
1    Ben      M   24
2  Maria      F   30
3  David      M   27
   Names variable value
0   Lisa   Gender     F
1    Ben   Gender     M
2  Maria   Gender     F
3  David   Gender     M
4   Lisa      Age    23
5    Ben      Age    24
6  Maria      Age    30
7  David      Age    27

In [80]:
#giving a name to the value_vars variables as value_name
print(pd.melt(df,id_vars=["Names"],value_vars=["Gender","Age"],var_name="Gender&Age",value_name="values"))

   Names Gender&Age values
0   Lisa     Gender      F
1    Ben     Gender      M
2  Maria     Gender      F
3  David     Gender      M
4   Lisa        Age     23
5    Ben        Age     24
6  Maria        Age     30
7  David        Age     27